# DBeam_SetLampRot

```pascal
PROCEDURE DBeam_SetLampRot(rot : REAL);
```

```python
def vs.DBeam_SetLampRot(rot):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|rot|REAL|   |

## Examples
```pascal
DBeam_SetLampRot(1.0);
```
```python
import vs

rot = 1.0

vs.DBeam_SetLampRot(rot)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight